GopalSaraf/Practicals/PSDL/include/proc/pic18f2585.inc
// Register: TXB0CON
#define TXB0CON TXB0CON
TXB0CON                                  equ 0F40h
// bitfield definitions
TXB0CON_TXPRI0_POSN                      equ 0000h
TXB0CON_TXPRI0_POSITION                  equ 0000h
TXB0CON_TXPRI0_SIZE                      equ 0001h
TXB0CON_TXPRI0_LENGTH                    equ 0001h
TXB0CON_TXPRI0_MASK                      equ 0001h
TXB0CON_TXPRI1_POSN                      equ 0001h
TXB0CON_TXPRI1_POSITION                  equ 0001h
TXB0CON_TXPRI1_SIZE                      equ 0001h
TXB0CON_TXPRI1_LENGTH                    equ 0001h
TXB0CON_TXPRI1_MASK                      equ 0002h
TXB0CON_TXREQ_POSN                       equ 0003h
TXB0CON_TXREQ_POSITION                   equ 0003h
TXB0CON_TXREQ_SIZE                       equ 0001h
TXB0CON_TXREQ_LENGTH                     equ 0001h
TXB0CON_TXREQ_MASK                       equ 0008h
TXB0CON_TXERR_POSN                       equ 0004h
TXB0CON_TXERR_POSITION                   equ 0004h
TXB0CON_TXERR_SIZE                       equ 0001h
TXB0CON_TXERR_LENGTH                     equ 0001h
TXB0CON_TXERR_MASK                       equ 0010h
TXB0CON_TXLARB_POSN                      equ 0005h
TXB0CON_TXLARB_POSITION                  equ 0005h
TXB0CON_TXLARB_SIZE                      equ 0001h
TXB0CON_TXLARB_LENGTH                    equ 0001h
TXB0CON_TXLARB_MASK                      equ 0020h
TXB0CON_TXABT_POSN                       equ 0006h
TXB0CON_TXABT_POSITION                   equ 0006h
TXB0CON_TXABT_SIZE                       equ 0001h
TXB0CON_TXABT_LENGTH                     equ 0001h
TXB0CON_TXABT_MASK                       equ 0040h
TXB0CON_TXBIF_POSN                       equ 0007h
TXB0CON_TXBIF_POSITION                   equ 0007h
TXB0CON_TXBIF_SIZE                       equ 0001h
TXB0CON_TXBIF_LENGTH                     equ 0001h
TXB0CON_TXBIF_MASK                       equ 0080h
TXB0CON_TXB0PRI0_POSN                    equ 0000h
TXB0CON_TXB0PRI0_POSITION                equ 0000h
TXB0CON_TXB0PRI0_SIZE                    equ 0001h
TXB0CON_TXB0PRI0_LENGTH                  equ 0001h
TXB0CON_TXB0PRI0_MASK                    equ 0001h
TXB0CON_TXB0PRI1_POSN                    equ 0001h
TXB0CON_TXB0PRI1_POSITION                equ 0001h
TXB0CON_TXB0PRI1_SIZE                    equ 0001h
TXB0CON_TXB0PRI1_LENGTH                  equ 0001h
TXB0CON_TXB0PRI1_MASK                    equ 0002h
TXB0CON_TXB0REQ_POSN                     equ 0003h
TXB0CON_TXB0REQ_POSITION                 equ 0003h
TXB0CON_TXB0REQ_SIZE                     equ 0001h
TXB0CON_TXB0REQ_LENGTH                   equ 0001h
TXB0CON_TXB0REQ_MASK                     equ 0008h
TXB0CON_TXB0ERR_POSN                     equ 0004h
TXB0CON_TXB0ERR_POSITION                 equ 0004h
TXB0CON_TXB0ERR_SIZE                     equ 0001h
TXB0CON_TXB0ERR_LENGTH                   equ 0001h
TXB0CON_TXB0ERR_MASK                     equ 0010h
TXB0CON_TXB0LARB_POSN                    equ 0005h
TXB0CON_TXB0LARB_POSITION                equ 0005h
TXB0CON_TXB0LARB_SIZE                    equ 0001h
TXB0CON_TXB0LARB_LENGTH                  equ 0001h
TXB0CON_TXB0LARB_MASK                    equ 0020h
TXB0CON_TXB0ABT_POSN                     equ 0006h
TXB0CON_TXB0ABT_POSITION                 equ 0006h
TXB0CON_TXB0ABT_SIZE                     equ 0001h
TXB0CON_TXB0ABT_LENGTH                   equ 0001h
TXB0CON_TXB0ABT_MASK                     equ 0040h
TXB0CON_TX0IF_POSN                       equ 0007h
TXB0CON_TX0IF_POSITION                   equ 0007h
TXB0CON_TX0IF_SIZE                       equ 0001h
TXB0CON_TX0IF_LENGTH                     equ 0001h
TXB0CON_TX0IF_MASK                       equ 0080h

// Register: TXB0SIDH
#define TXB0SIDH TXB0SIDH
TXB0SIDH                                 equ 0F41h
// bitfield definitions
TXB0SIDH_SID3_POSN                       equ 0000h
TXB0SIDH_SID3_POSITION                   equ 0000h
TXB0SIDH_SID3_SIZE                       equ 0001h
TXB0SIDH_SID3_LENGTH                     equ 0001h
TXB0SIDH_SID3_MASK                       equ 0001h
TXB0SIDH_SID4_POSN                       equ 0001h
TXB0SIDH_SID4_POSITION                   equ 0001h
TXB0SIDH_SID4_SIZE                       equ 0001h
TXB0SIDH_SID4_LENGTH                     equ 0001h
TXB0SIDH_SID4_MASK                       equ 0002h
TXB0SIDH_SID5_POSN                       equ 0002h
TXB0SIDH_SID5_POSITION                   equ 0002h
TXB0SIDH_SID5_SIZE                       equ 0001h
TXB0SIDH_SID5_LENGTH                     equ 0001h
TXB0SIDH_SID5_MASK                       equ 0004h
TXB0SIDH_SID6_POSN                       equ 0003h
TXB0SIDH_SID6_POSITION                   equ 0003h
TXB0SIDH_SID6_SIZE                       equ 0001h
TXB0SIDH_SID6_LENGTH                     equ 0001h
TXB0SIDH_SID6_MASK                       equ 0008h
TXB0SIDH_SID7_POSN                       equ 0004h
TXB0SIDH_SID7_POSITION                   equ 0004h
TXB0SIDH_SID7_SIZE                       equ 0001h
TXB0SIDH_SID7_LENGTH                     equ 0001h
TXB0SIDH_SID7_MASK                       equ 0010h
TXB0SIDH_SID8_POSN                       equ 0005h
TXB0SIDH_SID8_POSITION                   equ 0005h
TXB0SIDH_SID8_SIZE                       equ 0001h
TXB0SIDH_SID8_LENGTH                     equ 0001h
TXB0SIDH_SID8_MASK                       equ 0020h
TXB0SIDH_SID9_POSN                       equ 0006h
TXB0SIDH_SID9_POSITION                   equ 0006h
TXB0SIDH_SID9_SIZE                       equ 0001h
TXB0SIDH_SID9_LENGTH                     equ 0001h
TXB0SIDH_SID9_MASK                       equ 0040h
TXB0SIDH_SID10_POSN                      equ 0007h
TXB0SIDH_SID10_POSITION                  equ 0007h
TXB0SIDH_SID10_SIZE                      equ 0001h
TXB0SIDH_SID10_LENGTH                    equ 0001h
TXB0SIDH_SID10_MASK                      equ 0080h
TXB0SIDH_TXB0SID3_POSN                   equ 0000h
TXB0SIDH_TXB0SID3_POSITION               equ 0000h
TXB0SIDH_TXB0SID3_SIZE                   equ 0001h
TXB0SIDH_TXB0SID3_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID3_MASK                   equ 0001h
TXB0SIDH_TXB0SID4_POSN                   equ 0001h
TXB0SIDH_TXB0SID4_POSITION               equ 0001h
TXB0SIDH_TXB0SID4_SIZE                   equ 0001h
TXB0SIDH_TXB0SID4_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID4_MASK                   equ 0002h
TXB0SIDH_TXB0SID5_POSN                   equ 0002h
TXB0SIDH_TXB0SID5_POSITION               equ 0002h
TXB0SIDH_TXB0SID5_SIZE                   equ 0001h
TXB0SIDH_TXB0SID5_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID5_MASK                   equ 0004h
TXB0SIDH_TXB0SID6_POSN                   equ 0003h
TXB0SIDH_TXB0SID6_POSITION               equ 0003h
TXB0SIDH_TXB0SID6_SIZE                   equ 0001h
TXB0SIDH_TXB0SID6_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID6_MASK                   equ 0008h
TXB0SIDH_TXB0SID7_POSN                   equ 0004h
TXB0SIDH_TXB0SID7_POSITION               equ 0004h
TXB0SIDH_TXB0SID7_SIZE                   equ 0001h
TXB0SIDH_TXB0SID7_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID7_MASK                   equ 0010h
TXB0SIDH_TXB0SID8_POSN                   equ 0005h
TXB0SIDH_TXB0SID8_POSITION               equ 0005h
TXB0SIDH_TXB0SID8_SIZE                   equ 0001h
TXB0SIDH_TXB0SID8_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID8_MASK                   equ 0020h
TXB0SIDH_TXB0SID9_POSN                   equ 0006h
TXB0SIDH_TXB0SID9_POSITION               equ 0006h
TXB0SIDH_TXB0SID9_SIZE                   equ 0001h
TXB0SIDH_TXB0SID9_LENGTH                 equ 0001h
TXB0SIDH_TXB0SID9_MASK                   equ 0040h
TXB0SIDH_TXB0SID10_POSN                  equ 0007h
TXB0SIDH_TXB0SID10_POSITION              equ 0007h
TXB0SIDH_TXB0SID10_SIZE                  equ 0001h
TXB0SIDH_TXB0SID10_LENGTH                equ 0001h
TXB0SIDH_TXB0SID10_MASK                  equ 0080h

